uhnp/src/Enums/ВариантыОтраженияКорректировокПоступлений/ВариантыОтраженияКорректировокПоступлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОтраженияКорректировокПоступлений</name>
  <enumValues>
    <name>ОтразитьНаПрочихДоходах</name>
  </enumValues>
  <enumValues>
    <name>СписатьНаРасходы</name>
  </enumValues>
  <enumValues>
    <name>УвеличитьЗакупкуУвеличитьСкладскиеОстатки</name>
  </enumValues>
  <enumValues>
    <name>УвеличитьЗакупкуУчестьПриИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>УвеличитьСтоимостьТовара</name>
  </enumValues>
  <enumValues>
    <name>УменьшитьЗакупкуУменьшитьСкладскиеОстатки</name>
  </enumValues>
  <enumValues>
    <name>УменьшитьЗакупкуУчестьПриИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>УменьшитьСтоимостьТовара</name>
  </enumValues>
  <enumValues>
    <name>УвеличитьЗакупкуУвеличитьТоварыУПартнеров</name>
  </enumValues>
  <enumValues>
    <name>УменьшитьЗакупкуУменьшитьТоварыУПартнеров</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВариантыОтраженияКорректировокПоступлений/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ТекстПояснения = "";
	ВысотаПояснения = 1;
	
	Если Параметры.Отбор.Свойство("Ссылка")
	 И ТипЗнч(Параметры.Отбор.Ссылка) = Тип("СписокЗначений") Тогда
	 	
	 	ДоступныеВарианты = Параметры.Отбор.Ссылка;
		Если ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокПоступлений.УвеличитьЗакупкуУчестьПриИнвентаризации) <> Неопределено
			Или Параметры.ИмяСвойстваДляРезультатаВыбора = "ВариантОтраженияУвеличениеКоличестваПоОрдерномуСкладу" Тогда
			ВысотаПояснения = 4;
			ТекстПояснения = НСтр("ru = 'Количество товара по документу больше. Используется ордерная схема при отражении излишков и недостач.';
									|en = 'Quantity of goods against the document is greater. Warehouse management is used to record surpluses and shortages.'") + Символы.ПС + Символы.ПС;
		ИначеЕсли ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокПоступлений.УвеличитьЗакупкуУвеличитьСкладскиеОстатки) <> Неопределено
			Или Параметры.ИмяСвойстваДляРезультатаВыбора = "ВариантОтраженияУвеличениеКоличестваБезИнвентаризации" Тогда
			ВысотаПояснения = 4;
			ТекстПояснения = НСтр("ru = 'Количество товара по документу больше. Не используется ордерная схема при отражении излишков и недостач.';
									|en = 'Quantity of goods against the document is greater. Warehouse management is not used to record surpluses and shortages.'") + Символы.ПС + Символы.ПС;
		ИначеЕсли ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокПоступлений.УменьшитьЗакупкуУчестьПриИнвентаризации) <> Неопределено
			Или Параметры.ИмяСвойстваДляРезультатаВыбора = "ВариантОтраженияУменьшениеКоличестваПоОрдерномуСкладу" Тогда
			ВысотаПояснения = 4;
			ТекстПояснения = НСтр("ru = 'Количество товара по документу меньше. Используется ордерная схема при отражении излишков и недостач.';
									|en = 'Quantity of goods against the document is less. Warehouse management is used to record surpluses and shortages.'") + Символы.ПС + Символы.ПС;
		ИначеЕсли ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокПоступлений.УменьшитьЗакупкуУменьшитьСкладскиеОстатки) <> Неопределено
			Или Параметры.ИмяСвойстваДляРезультатаВыбора = "ВариантОтраженияУменьшениеКоличестваБезИнвентаризации" Тогда
			ВысотаПояснения = 4;
			ТекстПояснения = НСтр("ru = 'Количество товара по документу меньше. Не используется ордерная схема при отражении излишков и недостач.';
									|en = 'Quantity of goods against the document is less. Warehouse management is not used to record surpluses and shortages.'") + Символы.ПС + Символы.ПС;
		ИначеЕсли Параметры.ИмяСвойстваДляРезультатаВыбора = "ВариантОтраженияУменьшениеСуммы" Тогда
			ВысотаПояснения = 2;
			ТекстПояснения = НСтр("ru = 'Сумма по документу меньше.';
									|en = 'The document amount is smaller.'") + Символы.ПС + Символы.ПС;
		ИначеЕсли Параметры.ИмяСвойстваДляРезультатаВыбора = "ВариантОтраженияУвеличениеСуммы" Тогда
			ВысотаПояснения = 2;
			ТекстПояснения = НСтр("ru = 'Сумма по документу больше.';
									|en = 'The document amount is bigger.'") + Символы.ПС + Символы.ПС;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ТекстПояснения.Высота = ВысотаПояснения;
	ТекстПояснения = ТекстПояснения + НСтр("ru = 'Выберите вариант отражения расхождений:';
											|en = 'Select a discrepancy posting option:'");
	
КонецПроцедуры

#КонецОбласти
